diplom-src/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммыНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область  ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ОсновныеНачисления.Очистить();
	Объект.ДополнительныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_Сотрудник КАК Сотрудник,
	               |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	               |		ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_Сотрудник = ВКМ_ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	ВКМ_ФизическиеЛица.Подразделение = &Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_ФизическиеЛица.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	               |ГДЕ
	               |	ВКМ_ФизическиеЛица.Подразделение = &Подразделение"; 
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", (НачалоМесяца(КонецДня(Объект.Дата))));
	Запрос.УстановитьПараметр("КонецПериода", (КонецМесяца(КонецДня(Объект.Дата))));
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаДополнительныеНачисления = МассивРезультатов[0].Выбрать();
	ВыборкаОсновныеНачисления = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаДополнительныеНачисления.Следующий() Цикл
		
		НоваяСтрока = Объект.ДополнительныеНачисления.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДополнительныеНачисления.Сотрудник;
		НоваяСтрока.СуммаНачисления = ВыборкаДополнительныеНачисления.СуммаКОплатеПриход;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ПремияОтПродаж;
		
	КонецЦикла; 
	
	Пока ВыборкаОсновныеНачисления.Следующий() Цикл
		
		НоваяСтрока = Объект.ОсновныеНачисления.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаОсновныеНачисления.Сотрудник;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		НоваяСтрока.ДатаНачала = НачалоМесяца(Объект.Дата);
		НоваяСтрока.ДатаОкончания = КонецМесяца(Объект.Дата);
		НоваяСтрока.ГрафикРаботы = Справочники.ВКМ_ГрафикиРаботы.НайтиПоНаименованию("5/2");
				
	КонецЦикла; 		
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните подразделение. Продолжение не возможно");
		Возврат;
		
	Иначе 
		
		ЗаполнитьНаСервере();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
